// დავალების აღწერა:
// 1.იუზერს prompt-ით შეაყვანინეთ რიცხვი და for ლუპის დახმარებით გამოიტანეთ კონსოლში 
// ყველა რიცხვი 0-დან ამ რიცხვამდე. 


// let number = Number(prompt("შეიყვანეთ რიცხვი:"));


// for (let n = 1; n <= number; i++) {
//    console.log(i);}




//  2.დაწერეთ for ლუპი, რომელიც დაითვლის და 
//  კონსოლში გამოიტანს 1-დან 10-მდე რიცხვების ჯამს.

// let sum = 0;


// let i = Number(prompt("შეიყვანეთ რიცხვი:"));


// for (let n = 1; n <= i; n++) {
//     sum += n;
// }


// console.log(`1-დან ${i}-მდე რიცხვების ჯამი არის: ${sum}`);
// alert(`1-დან ${i}-მდე რიცხვების ჯამი არის: ${sum}`);





//  3. 
// იუზერს შეაყვანინეთ რიცხვი. while ლუპის გამოყენებით დაითვალეთ და გამოიტანეთ კონსოლში რამდენჯერ უნდა გამოვაკლოთ 1,
//   რომ მივიღოთ 0. 


// let number = Number(prompt("შეიყვანეთ რიცხვი:"));
// let originalNumber = number;

// let count = 0;

// while (number > 0) {
//     number = number - 1; 
//     count++;}

// console.log(`რიცხვს ${originalNumber}-ს   ${count} -ჯერ უნდა გამოვაკლოთ 1, რომ მივიღოთ ნული`);
 



//  4.დაწერეთ for ლუპი, რომელიც კონსოლში გამოიტანს ყველა რიცხვს 1-დან 50-მდე, 
//   რომელიც იყოფა 5-ზე. 



//  for (let i = 1; i <= 50; i++) {
//     if (i % 5 == 0) { 
//         console.log(i);
//     }
// }



// 5.აწერეთ while ლუპი, რომელიც კონსოლში გამოიტანს რიცხვებს 1-დან 100-მდე, 
// // //  მაგრამ შეჩერდება, როცა რიცხვი გახდება 37. 
// // 
// let number = 1;

// while (number <= 100) {
//     if (number == 37) {
//         break;
//     }
//     console.log(number);
//     number++;
// }




// 6.ცოტა ჩელენჯი 💪იუზერს შეაყვანინეთ რიცხვი და for ლუპის გამოყენებით შეამოწმეთ,
// //  არის თუ არა ეს რიცხვი დადებითი, უარყოფითი ან ნული (შედეგი გამოიტანეთ კონსოლში)

// let number = Number(prompt("შეიყვანეთ რიცხვი:"));

// for (let i = 0; i < 1; i++) {
//     if (number > 0) {
//         console.log(`${number} არის დადებითი რიცხვი`);
//     } else if (number < 0) {
//         console.log(`${number} არის უარყოფითი რიცხვი`);
//     } else {
//         console.log("რიცხვი არის ნული");
//     }
// }